Repository: adib-Wageeh/Needs-Delivery
Catalog: lib/l10n/intl_*.arb
Languages: ar

# login_title
source: Log In
ar: تسجيل دخول

# login_subTitle
source: Please enter your data to login
ar: من فضلك أدخل البيانات لتسجيل الدخول

# login_phone_number_hint
source: Mobile
ar: رقم الهاتف

# login_password_hint
source: Password
ar: كلمة السر

# login_button
source: Log In
ar: تسجيل دخول

# login_forgetPassword
source: Forgot Your Password
ar: نسيت كلمة المرور

# login_register
source: Don't have an account? Sign Up
ar: ليس لديك حساب؟ تسجيل حساب جديد

# check_your_data
source: Check your login data
ar: برجاء التأكد من بياناتك

# user_rejected
source: Your account has been rejected
ar: تم رفض الحساب الخاص بك

# empty_field
source: is required
ar: مطلوب

# empty_field_fem
source: is required
ar: مطلوبة

# register_title
source: Sign Up
ar: حساب جديد

# register_subTitle
source: Please fill all the fields
ar: برجاء ملئ جميع الحقول

# register_first_name_hint
source: First Name
ar: الأسم الأول

# register_last_name_hint
source: Last Name
ar: الأسم الأخير

# register_email_hint
source: Email
ar: البريد الألكترونى

# register_business_name_hint
source: Business Name
ar: الأسم التجارى

# register_location_hint
source: Location
ar: الموقع

# register_address_hint
source: Address
ar: العنوان

# register_password_hint
source: Password
ar: كلمة السر

# register_confirm_password_hint
source: Confirm Password
ar: تأكيد كلمة السر

# register_button
source: Sign Up
ar: تسجيل حساب

# register_login
source: Already have an account? Log in
ar: لديك بالفعل حساب؟ سجل الدخول

# location_permission_permenantly
source: You must enable the location permission from settings
ar: يجب عليك تمكين إذن الموقع من الإعدادات

# location_permission_refused
source: Please allow location permission to access your location
ar: يرجى السماح لإذن الموقع بالوصول إلى موقعك

# location_disabled
source: The location service on the device is disabled.
ar: برجاء تفعيل خدمة تحديد الموقع على الهاتف

# no_connection_error
source: Check your internet Connection
ar: تحقق من اتصالك بالإنترنت

# phone_valid_number_error
source: Please enter a valid number
ar: برجاء إدخال رقم هاتف صحيح

# empty_password_text_field_error
source: Password is required
ar: كلمة السر مطلوبة

# password_length_error
source: Should be more than 5 characters
ar: يجب أن يكون أكثر من 5 أحرف

# password_confirm_error_hint
source: Must match password
ar: يجب أن يطابق كلمة السر

source: Try again
ar: حاول مرة أخرى

source: Loading...
ar: تحميل...

# pick_category_label
source: Pick Category
ar: أختر القسم

# pick_category_error
source: Pick a category
ar: برجاء أختيار القسم

source: No internet connection
ar: لا يوجد أتصال بالأنترنت

# ok_button
source: Ok
ar: حسنآ

# account_request_sent
source: Your account request has been sent to the management for approval
ar: تم إرسال طلب حسابك إلى الإدارة للموافقة عليه

# account_approval
source: Your account need approval from administration
ar: حسابك يحتاج الي موافقة الإدارة أولآ

# update_location_confirm
source: Location has been updated please confirm
ar: تم تحديث العنوان برجاء التأكيد

# old_password_error
source: Old password is not correct
ar: كلمة السر القديمة غير صحيحة

# password_updated
source: Password updated successfully
ar: تم تحديث كلمة السر بنجاح

# home_welcome
source: Welcome!
ar: أهلا!

# today_orders
source: Today's orders
ar: طلبات اليوم

source: Your orders
ar: طلباتك

# currency
source: LE
ar: ج

# partial_delivery_damaged_quantity_title
source: Select Amount Of Damaged Products
ar: حدد كمية المنتجات التالفة

# partial_delivery_returned_quantity_title
source: Select Amount Of The Products That Will Be Returned
ar: حدد كمية المرتجعات

# today_orders_start
source: Start
ar: إبدأ

# today_orders_end
source: End
ar: إنهاء

# refused_button
source: Refused
ar: مرفوض

# partial_button
source: Partial delivery
ar: توصيل جزئى

# full_delivery_button
source: Full delivery
ar: توصيل كلى

# damaged_button
source: Damaged products
ar: منتجات تالفة

# returned_products_button
source: Returned products
ar: مرتجعات

# total_delivered
source: Total:
ar: الأجمالى:

# date_title
source: Date
ar: التاريخ

# no_run_sheets
source: No Run Sheets Available
ar: لا توجد قوائم تشغيل

# online
source: Connected
ar: متصل

# offline
source: Disconnected
ar: غير متصل

source: Cancel
ar: إلغاء

# full_delivery_confirmation
source: Has this order been fully delivered?
ar: هل تم توصيل هذا الطلب كليآ؟

# partial_delivery_confirmation
source: Has this order been Partially delivered?
ar: هل تم توصيل هذا الطلب جزئيآ؟

# refused_delivery_confirmation
source: Was this order rejected?
ar: هل تم رفض هذا الطلب؟

source: Yes
ar: نعم

source: Invoices count:
ar: عدد الفواتير:

# order_amount
source: Amount
ar: وحدات

# order_units
source: Units
ar: كمية

source: Reason
ar: السبب

# invoice_total
source: Total Invoice Cost
ar: إجمالى تكلفة الفاتورة

# invalid_quantity_title
source: Invalid Quantity
ar: وحدات غير صحيحة

# invalid_quantity_sub_title
source: Enter Valid Quantity
ar: برجاء أدخال وحدات صحيحة

# invalid_unit_title
source: Invalid Unit
ar: كمية غير صحيحة

# invalid_unit_sub_title
source: Enter Valid Unit
ar: برجاء أدخال كمية صحيحة

# no_return_products
source: Enter Your Returned Products Amounts Or Units
ar: أدخل كميات أو وحدات المنتجات المرتجعات

# no_damage_products
source: Enter Your Damaged Products Amounts Or Units
ar: أدخل كميات أو وحدات المنتجات التالفة

# reason_error
source: Enter Your Reason
ar: برجاء أدخال السبب

# run_sheet_id
source: Runsheet No. #
ar: قائمة تشغيل رقم

# invoice_id
source: Invoice No. #
ar: فاتورة رقم

# profile_sign_out
source: LogOut
ar: تسجيل الخروج

# profile_my_profile
source: My Profile
ar: حسابى

# number_verification_confirm
source: Confirm
ar: تأكيد

# update_location
source: Update your location
ar: تحديث موقعك الحالى
